# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Вывод сети и маски должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате
  надо добавить два пробела между столбцами
  для разделения октетов между собой)

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ip_add_with_mask = input("Введите подсеть в формате ip/mask: " )
ip_add = ip_add_with_mask.split('/')[0]
mask = int(ip_add_with_mask.split('/')[1])
ip_add_list = ip_add.split('.')
mask_binary = "1" * mask + "0" * (32 - int(mask))


ip_template = '''
Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
'''

mask_template = '''
Mask:
/{0}
{1:<8} {2:<8} {3:<8} {4:<8}
{1:08b} {2:08b} {3:08b} {4:08b}
'''

print(ip_template.format(int(ip_add_list[0]), int(ip_add_list[1]), int(ip_add_list[2]), int(ip_add_list[3])))
print(mask_template.format(mask, int(mask_binary[0:8], 2), int(mask_binary[8:16], 2), int(mask_binary[16:24], 2), int(mask_binary[24:32], 2)))